/**
 * @file const.ts
 * @author afcfzf(9301462@qq.com)
 */

export const DESC_PLACEHOLDER = `请输入岗位职责、任职要求等描述，至少10个字，建议使用以下格式逐条列出：
 岗位职责
 1.....
 2.....
 任职要求
 1.....
 2.....
 补充说明
 工作时间、晋升说明、培训情况等
 `;

export const PUBLISH_DEFINITION = [
  {
    title: '一、职位名称发布规范',
    children: [
      '职位名称请勿包含以下信息，包括不限于：',
      '含违法违规信息',
      '含性别、学历、院校、地区、民族等歧视性信息',
      '含认证、融资、招商、培训、推广、挂靠等非招聘或非提供实际就业机会信息',
      '含特殊字符、一职多岗、薪资体现、与职位名称无关等不规范信息',
    ],
  },
  {
    title: '二、 职位描述发布规范',
    children: [
      '职位描述请勿包含以下信息，包括不限于：',
      '含违法违规信息',
      '含性别、学历、院校、地区、民族等歧视性信息',
      '含认证、融资、招商、培训、推广、产品售卖、挂靠等非招聘或非提供实际就业机会信息',
      '含收费及潜在收费信息',
      '含特殊字符、彩色字体底纹，图片等不规范信息',
      '含微信、QQ、手机等联系方式信息',
      '除岗位职责、任职条件、工作技能、薪资待遇、汇报关系、业绩指标以外与职位描述无关信息',
    ],
  },
  {
    title: '三、 公司内容简介规范',
    children: [
      '公司简介请勿包含以下信息，包括不限于：',
      '含第三方或违法违规链接',
      '含商标、品牌、专利等侵权信息',
      '含与企业性质、规模等不符或夸大宣传的信息',
      '含特殊字符、彩色字体底纹，图片等不规范信息',
      '含微信、QQ、手机等联系方式信息',
    ],
  },
];

export const SHORT_TIP = `1. 您可以问下招聘需求方，他们更懂得如何用有趣且个性化的方式来吸引该类人才。
2. 建议填写调薪机制&晋升通道、是否牛人带队、团队氛围、企业发展潜力等。
`;


